uncode-framework-ws/ws/soap_spring_cxf_wss4j/doc/inbound-3.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1">
            <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-ab21c91e-1dd4-49c5-94f7-606301991e0e">
                <ds:SignedInfo>
                    <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                        <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"></ec:InclusiveNamespaces>
                    </ds:CanonicalizationMethod>
                    <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                    <ds:Reference URI="#id-1cd390f4-4cee-4a5a-b44b-da8d7ed8258e">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                                <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""></ec:InclusiveNamespaces>
                            </ds:Transform>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <ds:DigestValue>UEDU9/7CTPhZ4ME0h/levZF4lEQ=</ds:DigestValue>
                    </ds:Reference>
                </ds:SignedInfo>
                <ds:SignatureValue>MqdaRzR8LOx3B456B+PHqy/A4L7ozzyXsdde9PZNrI2VzIZrPwnkf6SMGedg2nuLPBKmWeFfN9JwnLR5p8KWZ398P/giNrJN/yZRUueFmMUmO5Q0g+dww7Sw896Z+2koiaY/uHh8+ZbxFOh443n/RGrqqXbR3GfT/xnCcfo+MVw=</ds:SignatureValue>
                <ds:KeyInfo Id="KI-004a1cfb-aafe-45d9-a782-6862180f7cc6">
                    <wsse:SecurityTokenReference wsu:Id="STR-b2ad16a7-b52f-4815-954d-e6ee25a6d1b4">
                        <ds:X509Data>
                            <ds:X509IssuerSerial>
                                <ds:X509IssuerName>CN=client</ds:X509IssuerName>
                                <ds:X509SerialNumber>1404051942</ds:X509SerialNumber>
                            </ds:X509IssuerSerial>
                        </ds:X509Data>
                    </wsse:SecurityTokenReference>
                </ds:KeyInfo>
            </ds:Signature>
        </wsse:Security>
    </SOAP-ENV:Header>
    <soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-1cd390f4-4cee-4a5a-b44b-da8d7ed8258e">
        <ns2:say xmlns:ns2="http://soap_spring_cxf_wss4j.ws.demo/">
            <arg0>world</arg0>
        </ns2:say>
    </soap:Body>
</soap:Envelope>